# Pandas

In [1]:
import pandas as pd
import numpy as np

## Series

### Basic Init

a. Using Lists

In [2]:
s = pd.Series(["India","USA","Russia","Norway","China","UK"], index=['a', 'b', 'c', 'd', 'e', 'f'], name="Numbers")
# index is optional, by default, a 0-n index will be given

In [3]:
s

a     India
b       USA
c    Russia
d    Norway
e     China
f        UK
Name: Numbers, dtype: object

b. Using a dictionary

In [4]:
d = pd.Series({'x': 9, 'y': 8, 'z': 7}, name='bruh')

In [5]:
d

x    9
y    8
z    7
Name: bruh, dtype: int64

c. Using a CSV file

In [6]:
df = pd.read_csv("data/nile.csv")['Flood']
df

0       9.9974
1      10.5556
2       9.9014
3      11.4800
4      12.8460
        ...
565    11.3840
566     9.8630
567    10.8450
568    10.4020
569    10.3060
Name: Flood, Length: 570, dtype: float64

In [7]:
df.head()

0     9.9974
1    10.5556
2     9.9014
3    11.4800
4    12.8460
Name: Flood, dtype: float64

d. Using another Series

In [8]:
p = pd.Series(s,index=['a','c','d','f'])

In [9]:
p

a     India
c    Russia
d    Norway
f        UK
Name: Numbers, dtype: object

### Basic properties

In [10]:
s.name

'Numbers'

In [11]:
s.dtype

dtype('O')

In [12]:
s.values

array(['India', 'USA', 'Russia', 'Norway', 'China', 'UK'], dtype=object)

In [13]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [14]:
s.value_counts()

India     1
USA       1
Russia    1
Norway    1
China     1
UK        1
Name: Numbers, dtype: int64

### Accessing & Modifying data

When it comes to accessing and modifying data, we treat it like a dict

In [15]:
s['a']

'India'

In [16]:
d.iloc[1]

8

We can select multiple at once

In [17]:
s[['a','c','f']]

a     India
c    Russia
f        UK
Name: Numbers, dtype: object

In [18]:
df.iloc[[60, 61, 63, 69]]

60    9.2280
61    9.5736
63    9.0922
69    8.9578
Name: Flood, dtype: float64

Slicing also works

In [19]:
s['b':'e']

b       USA
c    Russia
d    Norway
e     China
Name: Numbers, dtype: object

In [20]:
df.iloc[50:54]

50     9.0730
51     9.2664
52     9.7670
53    10.3060
Name: Flood, dtype: float64

We can also use conditonal selection with boolean arrays

In [21]:
d>8

x     True
y    False
z    False
Name: bruh, dtype: bool

In [22]:
d[d>=8]

x    9
y    8
Name: bruh, dtype: int64

In [23]:
d['x'] = 10
d

x    10
y     8
z     7
Name: bruh, dtype: int64

In [24]:
d.iloc[2] = 12
d

x    10
y     8
z    12
Name: bruh, dtype: int64

In [25]:
d[d >= 10] = d-5
d

x    5
y    8
z    7
Name: bruh, dtype: int64

### Functions

In [26]:
df.mean()

10.780632631578943

In [27]:
df.std()

0.8836778665316819

In [28]:
np.log(df)

0      2.302325
1      2.356657
2      2.292676
3      2.440606
4      2.553032
         ...
565    2.432209
566    2.288790
567    2.383704
568    2.341998
569    2.332726
Name: Flood, Length: 570, dtype: float64

## Dataframes

### Basic init

a. Using CSV

In [29]:
df = pd.read_csv("data/oscar_age_male.csv")
df

,Index,Year,Age,Name,Movie
0,1,1928,44,Emil Jannings,"The Last Command, The Way of All Flesh"
1,2,1929,41,Warner Baxter,In Old Arizona
2,3,1930,62,George Arliss,Disraeli
3,4,1931,53,Lionel Barrymore,A Free Soul
4,5,1932,47,Wallace Beery,The Champ
...,...,...,...,...,...
84,85,2012,39,Jean Dujardin,The Artist
85,86,2013,55,Daniel Day-Lewis,Lincoln
86,87,2014,44,Matthew McConaughey,Dallas Buyers Club
87,88,2015,33,Eddie Redmayne,The Theory of Everything\t
88,89,2016,41,Leonardo DiCaprio,The Revenant

b. Using a dict of {column:list}

In [30]:
sdf = pd.DataFrame({'Name':
                   ['Hardik', 'John', "Mark", 'Steve', "Ak", "priti", "Tanmay"],
                   'Score': [
                       1785387,
                       2833687,
                       3874437,
                       2167744,
                       4602367,
                       2950039,
                       17348075
                   ],
                   'Continent': [
                       'America',
                       'Europe',
                       'Europe',
                       'Europe',
                       'Asia',
                       'Europe',
                       'America'
                   ]}, columns=['Name', 'Score', 'Continent'])
sdf

     Name     Score Continent
0  Hardik   1785387   America
1    John   2833687    Europe
2    Mark   3874437    Europe
3   Steve   2167744    Europe
4      Ak   4602367      Asia
5   priti   2950039    Europe
6  Tanmay  17348075   America

In [31]:
sdf.index = sdf['Name'].values

In [32]:
sdf

          Name     Score Continent
Hardik  Hardik   1785387   America
John      John   2833687    Europe
Mark      Mark   3874437    Europe
Steve    Steve   2167744    Europe
Ak          Ak   4602367      Asia
priti    priti   2950039    Europe
Tanmay  Tanmay  17348075   America

In [33]:
del sdf['Name']

In [34]:
sdf

           Score Continent
Hardik   1785387   America
John     2833687    Europe
Mark     3874437    Europe
Steve    2167744    Europe
Ak       4602367      Asia
priti    2950039    Europe
Tanmay  17348075   America

In [35]:
# sdf.index = np.arange(sdf.shape[0])

In [36]:
# sdf

In [37]:
df.size

445

In [38]:
df.shape

(89, 5)

In [39]:
df.describe()

           Index         Year        Age
count  89.000000    89.000000  89.000000
mean   45.000000  1972.000000  43.876404
std    25.836021    25.836021   8.818653
min     1.000000  1928.000000  29.000000
25%    23.000000  1950.000000  38.000000
50%    45.000000  1972.000000  42.000000
75%    67.000000  1994.000000  49.000000
max    89.000000  2016.000000  76.000000

In [40]:
df.dtypes

Index     int64
Year      int64
Age       int64
Name     object
Movie    object
dtype: object

### Indexing and Slicing

In [41]:
sdf.loc['Steve']

Score        2167744
Continent     Europe
Name: Steve, dtype: object

In [42]:
sdf.iloc[2]

Score        3874437
Continent     Europe
Name: Mark, dtype: object

In [43]:
sdf.iloc[-1]

Score        17348075
Continent     America
Name: Tanmay, dtype: object

In [44]:
ss = sdf['Continent']

In [45]:
ss.values

array(['America', 'Europe', 'Europe', 'Europe', 'Asia', 'Europe',
       'America'], dtype=object)

In [46]:
df

,Index,Year,Age,Name,Movie
0,1,1928,44,Emil Jannings,"The Last Command, The Way of All Flesh"
1,2,1929,41,Warner Baxter,In Old Arizona
2,3,1930,62,George Arliss,Disraeli
3,4,1931,53,Lionel Barrymore,A Free Soul
4,5,1932,47,Wallace Beery,The Champ
...,...,...,...,...,...
84,85,2012,39,Jean Dujardin,The Artist
85,86,2013,55,Daniel Day-Lewis,Lincoln
86,87,2014,44,Matthew McConaughey,Dallas Buyers Club
87,88,2015,33,Eddie Redmayne,The Theory of Everything\t
88,89,2016,41,Leonardo DiCaprio,The Revenant

In [47]:
df[['Year','Movie']]

    Year                                   Movie
0   1928  The Last Command, The Way of All Flesh
1   1929                          In Old Arizona
2   1930                                Disraeli
3   1931                             A Free Soul
4   1932                               The Champ
..   ...                                     ...
84  2012                              The Artist
85  2013                                 Lincoln
86  2014                      Dallas Buyers Club
87  2015              The Theory of Everything\t
88  2016                            The Revenant

[89 rows x 2 columns]

In [48]:
df.loc[5:10]

    Index  Year  Age              Name                           Movie
5       6  1933   35     Fredric March         Dr. Jekyll and Mr. Hyde
6       7  1934   34  Charles Laughton  The Private Life of Henry VIII
7       8  1935   34       Clark Gable           It Happened One Night
8       9  1936   49   Victor McLaglen                  The Informer\t
9      10  1937   41         Paul Muni    The Story of Louis Pasteur\t
10     11  1938   37     Spencer Tracy             Captains Courageous

In [55]:
a = df.loc[6:10, ['Age', 'Name']]
a

    Age              Name
6    34  Charles Laughton
7    34       Clark Gable
8    49   Victor McLaglen
9    41         Paul Muni
10   37     Spencer Tracy

In [54]:
type(a)

pandas.core.frame.DataFrame

In [56]:
df.loc[df['Age'] > 40]

,Index,Year,Age,Name,Movie
0,1,1928,44,Emil Jannings,"The Last Command, The Way of All Flesh"
1,2,1929,41,Warner Baxter,In Old Arizona
2,3,1930,62,George Arliss,Disraeli
3,4,1931,53,Lionel Barrymore,A Free Soul
4,5,1932,47,Wallace Beery,The Champ
8,9,1936,49,Victor McLaglen,The Informer\t
9,10,1937,41,Paul Muni,The Story of Louis Pasteur\t
15,16,1943,43,James Cagney,Yankee Doodle Dandy\t
16,17,1944,48,Paul Lukas,Watch on the Rhine\t
17,18,1945,41,Bing Crosby,Going My Way
19,20,1947,49,Fredric March,The Best Years of Our Lives
20,21,1948,57,Ronald Colman,A Double Life
21,22,1949,41,Laurence Olivier,Hamlet
24,25,1952,52,Humphrey Bogart,The African Queen
25,26,1953,51,Gary Cooper,High Noon
30,31,1958,43,Alec Guinness,The Bridge on the River Kwai
31,32,1959,49,David Niven,Separate Tables
33,34,1961,47,Burt Lancaster,Elmer Gantry
35,36,1963,47,Gregory Peck,To Kill a Mockingbird
37,38,1965,57,Rex Harrison,My Fair Lady
38,39,1966,42,Lee Marvin,Cat Ballou\t
39,40,1967,45,Paul Scofield,A Man for All Seasons
40,41,1968,42,Rod Steiger,In the Heat of the Night\t
41,42,1969,45,Cliff Robertson,Charly
42,43,1970,62,John Wayne,True Grit
43,44,1971,43,George C. Scott,Patton
44,45,1972,42,Gene Hackman,The French Connection
45,46,1973,48,Marlon Brando,The Godfather
46,47,1974,49,Jack Lemmon,Save the Tiger
47,48,1975,56,Art Carney,Harry and Tonto
49,50,1977,60,Peter Finch,Network
52,53,1980,42,Dustin Hoffman,Kramer vs. Kramer
54,55,1982,76,Henry Fonda,On Golden Pond
56,57,1984,53,Robert Duvall,Tender Mercies
57,58,1985,45,F. Murray Abraham,Amadeus
59,60,1987,62,Paul Newman,The Color of Money
60,61,1988,43,Michael Douglas,Wall Street
61,62,1989,51,Dustin Hoffman,Rain Man
63,64,1991,42,Jeremy Irons,Reversal of Fortune
64,65,1992,54,Anthony Hopkins,The Silence of the Lambs
65,66,1993,52,Al Pacino,Scent of a Woman
69,70,1997,45,Geoffrey Rush,Shine
70,71,1998,60,Jack Nicholson,As Good as It Gets
71,72,1999,46,Roberto Benigni,Life Is Beautiful
74,75,2002,47,Denzel Washington,Training Day\t
76,77,2004,43,Sean Penn,Mystic River
79,80,2007,45,Forest Whitaker,The Last King of Scotland\t
80,81,2008,50,Daniel Day-Lewis,There Will Be Blood
81,82,2009,48,Sean Penn,Milk
82,83,2010,60,Jeff Bridges,Crazy Heart
83,84,2011,50,Colin Firth,The King's Speech\t
85,86,2013,55,Daniel Day-Lewis,Lincoln
86,87,2014,44,Matthew McConaughey,Dallas Buyers Club
88,89,2016,41,Leonardo DiCaprio,The Revenant